tools/schemaTests/2019-01-01/Microsoft.ApiManagement.ServiceApiOperations.tests.json

{
  "tests": [
    {
      "name": "ApiManagement Service Api Operation - Minimal",
      "definition": "https://schema.management.azure.com/schemas/2019-01-01/Microsoft.ApiManagement.json#/resourceDefinitions/service_apis_operations",
      "json": {
        "apiVersion": "2019-01-01",
        "type": "Microsoft.ApiManagement/service/apis/operations",
        "name": "57d2ef278aa04f0ad01d6cdc",
        "properties": {
          "displayName": "CancelOrder",
          "method": "POST",
          "urlTemplate": "/?soapAction=http://tempuri.org/IFazioService/CancelOrder",
          "templateParameters": [],
          "request": {
            "description": "IFazioService_CancelOrder_InputMessage",
            "queryParameters": [],
            "headers": [],
            "representations": [
              {
                "contentType": "text/xml",
                "sample": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<Envelope xmlns=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n  <Body>\r\n    <CancelOrder xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns=\"http://tempuri.org/\">\r\n      <orderId>1</orderId>\r\n    </CancelOrder>\r\n  </Body>\r\n</Envelope>",
                "schemaId": "6980a395-f08b-4a59-8295-1440cbd909b8",
                "typeName": "CancelOrder"
              }
            ]
          },
          "responses": [
            {
              "statusCode": 200,
              "description": "IFazioService_CancelOrder_OutputMessage",
              "representations": [
                {
                  "contentType": "text/xml",
                  "sample": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<Envelope xmlns=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n  <Body>\r\n    <CancelOrderResponse xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns=\"http://tempuri.org/\">\r\n      <CancelOrderResult>1</CancelOrderResult>\r\n    </CancelOrderResponse>\r\n  </Body>\r\n</Envelope>",
                  "schemaId": "6980a395-f08b-4a59-8295-1440cbd909b8",
                  "typeName": "CancelOrderResponse"
                }
              ],
              "headers": []
            }
          ]
        }
      }
    },
    {
      "name": "ApiManagement Service Api Operation - invalidType",
      "expectedErrors": [
        {
          "message": "No enum match for: \"Microsoft.ApiManagement/invalidType\"",
          "dataPath": "/type",
          "schemaPath": "/properties/type/type"
        },
        {
          "message": "No enum match for: \"2015-10-12\"",
          "dataPath": "/apiVersion",
          "schemaPath": "/properties/apiVersion/type"
        }
      ],
      "definition": "https://schema.management.azure.com/schemas/2019-01-01/Microsoft.ApiManagement.json#/resourceDefinitions/service_apis_operations",
      "json": {
        "type": "Microsoft.ApiManagement/invalidType",
        "apiVersion": "2015-10-12",
        "name": "57d2ef278aa04f0ad01d6cdc",
        "properties": {
          "displayName": "CancelOrder",
          "method": "POST",
          "urlTemplate": "/?soapAction=http://tempuri.org/IFazioService/CancelOrder",
          "templateParameters": [],
          "request": {
            "description": "IFazioService_CancelOrder_InputMessage",
            "queryParameters": [],
            "headers": [],
            "representations": [
              {
                "contentType": "text/xml",
                "sample": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<Envelope xmlns=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n  <Body>\r\n    <CancelOrder xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns=\"http://tempuri.org/\">\r\n      <orderId>1</orderId>\r\n    </CancelOrder>\r\n  </Body>\r\n</Envelope>",
                "schemaId": "6980a395-f08b-4a59-8295-1440cbd909b8",
                "typeName": "CancelOrder"
              }
            ]
          },
          "responses": [
            {
              "statusCode": 200,
              "description": "IFazioService_CancelOrder_OutputMessage",
              "representations": [
                {
                  "contentType": "text/xml",
                  "sample": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<Envelope xmlns=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n  <Body>\r\n    <CancelOrderResponse xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns=\"http://tempuri.org/\">\r\n      <CancelOrderResult>1</CancelOrderResult>\r\n    </CancelOrderResponse>\r\n  </Body>\r\n</Envelope>",
                  "schemaId": "6980a395-f08b-4a59-8295-1440cbd909b8",
                  "typeName": "CancelOrderResponse"
                }
              ],
              "headers": []
            }
          ]
        }
      }
    }
  ]
}